
Функция GET_xml(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	number = Запрос.ПараметрыURL.Получить("number");
	РезультатВозврата = "ok";
	Формат = Запрос.ПараметрыЗапроса.Получить("format");
	ФорматТабличногоДокумента =ЗначениеЗаполнено(Формат);
	Если ФорматТабличногоДокумента тогда
		ФорматТабличногоДокумента = не найти("ANSITXT,DOCX,HTML,HTML3,HTML4,HTML5,MXL,MXL7,ODS,PDF,TXT,XLS,XLS95,XLS97,XLSX",Врег(Формат)) = 0;
	КонецЕсли;
	
	Если ФорматТабличногоДокумента тогда
		ДокументРезультат = новый ТабличныйДокумент;	
	Иначе	
		ДокументРезультат = новый ТаблицаЗначений;
	КонецЕсли;
	
	Обработки.web_ОбработкаWebServise.ВернутьДанныеОтчетаПоКоду(number, ДокументРезультат, Запрос);
		
	
	Если не ДокументРезультат = Неопределено тогда	
		Если Формат = "json"   тогда
		иначеЕсли ФорматТабличногоДокумента   тогда  //Файлы формвтов: "ANSITXT,DOCX,HTML,HTML3,HTML4,HTML5,MXL,MXL7,ODS,PDF,TXT,XLS,XLS95,XLS97,XLSX"
			Файл = ПолучитьИмяВременногоФайла();
			ТипФормата = ТипФайлаТабличногоДокумента[Формат];
			ДокументРезультат.Записать(Файл, ТипФормата);
			Данные = Новый ДвоичныеДанные(Файл);
			Ответ.УстановитьТелоИзДвоичныхДанных(Данные);
			УстановитьЗаголовки(ТипФормата,Ответ);
			УдалитьФайлы(Файл);
		иначеЕсли ТипЗнч(ДокументРезультат) = Тип("Строка") тогда
			Ответ.УстановитьТелоИзСтроки(ДокументРезультат,КодировкаТекста.ANSI, ИспользованиеByteOrderMark.НеИспользовать);
		Иначе	
			// Обработка таблицы значений
			ЗаписьXML = Новый ЗаписьXML;
			ЗаписьXML.УстановитьСтроку(,КодировкаТекста.ANSI);
			ЗаписьXML.ЗаписатьОбъявлениеXML();
			ЗаписьXML.ЗаписатьНачалоЭлемента("Root");
			Для А=0 По ДокументРезультат.Количество()-1 Цикл
				ЗаписьXML.ЗаписатьНачалоЭлемента("item");
				Для Каждого Колонка Из ДокументРезультат.Колонки Цикл
					ИмяАтрибута=Колонка.Имя;
					ЗначениеАтрибута=ДокументРезультат[А][Колонка.Имя];
					Если XMLТип(ТипЗнч(ЗначениеАтрибута)) = Неопределено тогда
						ЗначениеАтрибута = Строка(ЗначениеАтрибута);
					КонецЕсли;	
					Попытка
						ЗаписьXML.ЗаписатьАтрибут(ИмяАтрибута,СериализаторXDTO.XMLСтрока(ЗначениеАтрибута));
					Исключение
						Обработки.web_ОбработкаWebServise.addLog(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()) );
						ЗаписьXML.ЗаписатьАтрибут(ИмяАтрибута,СериализаторXDTO.XMLСтрока(Null));
					КонецПопытки;
				КонецЦикла;
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЦикла;
			ЗаписьXML.ЗаписатьКонецЭлемента();
			РезультатВозврата = ЗаписьXML.Закрыть();
			Ответ.УстановитьТелоИзСтроки(РезультатВозврата,КодировкаТекста.ANSI, ИспользованиеByteOrderMark.НеИспользовать);
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Ответ;
КонецФункции

Функция ПроверитьНеДопустимыеСимволы(Строка, Позиция = 1) 
	Если ТипЗнч(Строка) = Тип("Строка") тогда
		Число = НайтиНедопустимыеСимволыXML(Строка, Позиция);
		Если не Число = 0  Тогда
			Строка = СтрЗаменить(Строка, Сред(Строка, Число, 1), "_");
			ПроверитьНеДопустимыеСимволы(Строка);
		КонецЕсли;
	КонецЕсли;
КонецФункции	

Процедура  УстановитьЗаголовки(ТипФормата,Ответ)
	Соотвнтствие = новый Соответствие;
	Соотвнтствие.Вставить(ТипФайлаТабличногоДокумента.HTML5,"text/html;charset=utf-8");
	Соотвнтствие.Вставить(ТипФайлаТабличногоДокумента.HTML,"text/html;charset=utf-8");
	Соотвнтствие.Вставить(ТипФайлаТабличногоДокумента.HTML3,"text/html;charset=utf-8");
	Соотвнтствие.Вставить(ТипФайлаТабличногоДокумента.HTML4,"text/html;charset=utf-8");
	Соотвнтствие.Вставить(ТипФайлаТабличногоДокумента.TXT,"text/html;charset=utf-8");
	Соотвнтствие.Вставить(ТипФайлаТабличногоДокумента.PDF,"pdf");
	Заголовок = Соотвнтствие.Получить(ТипФормата);
	Если не Заголовок= Неопределено тогда
		Ответ.Заголовки.Вставить("Content-Type", Заголовок);
	КонецЕсли;
	
КонецПроцедуры	

Функция ReportDELETE(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	number = Запрос.ПараметрыURL.Получить("number");
	Если number = Неопределено тогда
		
		ПланОбмена = Неопределено;
	Иначе	
		ПланОбмена = ПланыОбмена.Полный.НайтиПоКоду(number);
	КонецЕсли;
	Если не ЗначениеЗаполнено(ПланОбмена) тогда
		Ответ = Новый HTTPСервисОтвет(200, "Не найден план обмена.");
	Иначе
		ПланыОбмена.УдалитьРегистрациюИзменений(ПланОбмена);
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции

